Repository: Dylamn/impact
Catalog: locale/*/LC_MESSAGES/django.po
Languages: fr

source: English
fr: Anglais

source: French
fr: Français

source: Content length (compressed page weight)
fr: Longueur du contenu (poids de page compressé)

source: The weight/size off the compressed content of all responses, i.e. what was transferred in packets (bytes). The smallest is it, the faster a slow connection can load the page.
fr: Le poids/la taille du contenu compressé de toutes les réponses, c'est-à-dire ce qui a été transféré en paquets (octets). Plus ce nombre est petit, plus une connexion lente peut charger la page.

source: Body size (final page weight)
fr: Poids total

source: The weight of the page with all assets (uncompressed). You must try to make it smaller as possible. In general, it must not exceed 1MB, which is already big enough for small connections that'll need some seconds to fully load the page.
fr: Le poids de la page avec toutes les ressources décompressés (images, vidéos, etc...). Vous devez essayer de le rendre aussi petit que possible. En général, il ne doit pas dépasser 1 Mo, ce qui est déjà assez lourd pour les petites connexions qui auront besoin de quelques secondes pour charger complètement la page.

source: DOM elements count
fr: Nombre d'éléments du DOM

source: A large DOM will increase memory usage, cause longer style calculations and produce layout reflows.
fr: Un DOM volumineux augmentera l'utilisation de la mémoire, entraînera des calculs de style plus longs et produira des reflux de mise en page. produire des reflux de mise en page.

source: DOM max depth
fr: Profondeur maximale du DOM

source: A DOM with deep nested elements makes the CSS matching slower.
fr: Un DOM avec des éléments profondément imbriqués rend la correspondance CSS plus lente. Cela ralenti également les modifications en javaScript.

source: Duplicated IDs
fr: ID dupliqués

source: The id attribute specifies a unique id for an HTML element. The value of the id attribute must be unique within the HTML document. It is mainly used to point to a specific style declaration in a style sheet. It is also used by JavaScript to access and manipulate the element with the specific id.
fr: L'attribut id spécifie un identifiant unique pour un élément HTML. La valeur de l'attribut id doit être unique dans le document HTML. Il est principalement utilisé pour pointer vers une déclaration de style spécifique dans une feuille de style. Il est également utilisé par JavaScript pour accéder et manipuler l'élément avec l'id spécifique. Avoir des duplicatas peut poser des problèmes avec `getElementById` qui peut retourner le mauvais élément.

source: Number of iframes
fr: Nombre d'iframes

source: iFrames are the most complex HTML elements. They are pages, just like the main page, and the browser needs to create a new page context, which has a cost.
fr: Les iframes sont des éléments HTML complexes. Ce sont des pages, tout comme la page principale, et le navigateur doit créer un nouveau contexte pour celles-ci, ce qui a un coût.

source: Externalize inline style
fr: Externaliser le style en ligne

source: Make sure that the CSS is separate from the HTML code of the page. If you include CSS in the body of the HTML file and it is used for multiple pages, the code must be sent for each page the user requests, increasing the amount of data sent. However, if the CSS is in its own separate file, the browser can avoid requesting them again by storing it in its local cache.
fr: Assurez-vous que le CSS est séparé du code HTML de la page. Si vous incluez le CSS dans le corps du fichier HTML et qu'il est utilisé pour plusieurs pages, le code doit être envoyé pour chaque page que l'utilisateur demande, ce qui augmente la quantité de données envoyées. Toutefois, si le CSS se trouve dans son propre fichier distinct, le navigateur peut éviter de le redemander à nouveau en le stockant dans le cache local.

source: DOM access
fr: Accès au DOM

source: This estimates the how much times the JavaScript interact with the DOM The more your JavaScript code accesses the DOM, the slower the page will load. Try to generate as much as possible your page statically (from the server side).
fr: Estimation du nombre de fois où le JavaScript interagit avec le DOM (durant le chargement de la page). Plus votre code JavaScript accède au DOM, plus le chargement de la page sera lent. Essayez de générer autant que possible votre page de manière statique (côté serveur).

source: Script execution duration
fr: Durée d'exécution des scripts

source: This is the number of milliseconds (ms) spent by the browser on JavaScript execution during the page load.
fr: Il s'agit du nombre de millisecondes (ms) consacrées par le navigateur à l'exécution de JavaScript pendant le chargement de la page.

source: Synchronous AJAX requests
fr: Requêtes AJAX synchrones

source: Making an XMLHttpRequest with the async option set to false is deprecated due to the negative effect to performances. The browser's main thread needs to stop everything until the response is received.
fr: La réalisation d'une requête XMLHttpRequest avec l'option `async` définie sur `false` est déprécié en raison de l'effet négatif sur les performances. Le thread principal du navigateur principal du navigateur doit tout arrêter jusqu'à ce que la réponse soit reçue.

source: Old HTTP protocol
fr: Ancien protocole HTTP

source: HTTP/2 is the latest version of the HTTP protocol. It is designed to optimize load speed. Below 5 requests, the benefits of HTTP/2 are generally less significant.
fr: HTTP/2 est la dernière version majeure du protocole HTTP. Il est conçu pour optimiser la vitesse de chargement. En dessous de 5 requêtes, les avantages de HTTP/2 sont généralement moins importants mais au dessus de ce seuil, le fait que la version 2 soit un protocole multiplexé (gestion de plusieurs requêtes en parallèle) est un réel gain. Ce n'est d'ailleurs pas la seule amélioration qu'apporte cette version.

source: Old TLS protocol
fr: Ancien protocole TLS

source: Counts the number of domains that use TLS versions < 1.3. This is the latest version since 2018 and it includes a faster "handshake" technology. Also, The 1.0 and 1.1 versions are deprecated and are considered as unsafe. You must atleast use the version 1.2.
fr: Le nombre de domaines qui utilisent des versions TLS < 1.3. Il s'agit de la dernière version depuis 2018 qui inclut un "handshake" plus rapide. De plus, les versions 1.0 et 1.1 sont dépréciées et la minimum à utiliser est donc la 1.2.

source: Caching disabled
fr: Mise en cache désactivée

source: Counts the number of responses that has been implicitly disabled for cache (the `max-age` is set to 0).
fr: Compte le nombre de réponses qui ont été implicitement désactivées pour le cache (la valeur de `max-age` étant fixé à 0).

source: Caching not specified
fr: Mise en cache non spécifiée

source: When no caching is specified, each browser will handle it differently. Most of the time, it will automatically add a cache for you, but not all the time. You'd better handle it yourself.
fr: Chaque navigateur effectue un traitement propre à lui Lorsque aucune mise en cache n'est spécifiée. La plupart du temps, il ajoutera automatiquement en cache, mais pas tout le temps. Il est donc préférable de s'en occuper soi-même.

source: The total number of HTTP requests a site has to deal with can have a massive impact on the overall loading speed as each request slows down the page loading.
fr: Le nombre total de requêtes HTTP qu'un site doit traiter peut avoir un impact massif sur la vitesse de chargement globale car chaque requête ralentit le chargement de la page.

source: Number of domains
fr: Nombre de domaines

source: For each domain met, the browser needs to make a DNS look-up, which is slow. Avoid having to many different domains and the page should render faster.
fr: Pour chaque domaine rencontré, le navigateur doit effectuer une recherche DNS, ce qui est plutôt lent (entre 20-120ms). Évitez d'avoir trop de domaines différents la page devrait s'afficher plus rapidement. Cette action est par la suite mise en cache et n'impact donc réellement que le chargement initial de la page.

source: 404 not found
fr: Erreurs 404 (Not Found)

source: 404 errors are never cached, so each time a not found is reached, thismeans that the server has been hit. Also no links must be broken on your page.
fr: Les erreurs 404 ne sont jamais mises en cache, donc à chaque fois qu'une "Not Found" est reçue, cela signifie que le serveur a été sollicité. Votre page doit donc n'avoir aucun lien qui mène intentionnellement à une erreur 404.

source: Below the fold images
fr: Images sous la ligne de flottaison (Below the fold images)

source: This is the number of images displayed below the fold that could be lazy-loaded. Lazily loading them can greatly improve the page speed.
fr: C'est le nombre d'images chargées et affichées sous la ligne de flottaison (sous la partie visible de la fenêtre) qui pourraient être chargées paresseusement (lazy loading). Lazy loader celles-ci peut améliorer considérablement la vitesse de la page.

source: My Reports
fr: Mes rapports

source: No reports were found.
fr: Aucun rapport n'a été trouvé.

source: We cannot etablish a network connection with the requested website.
fr: Nous ne pouvons pas établir une connexion réseau avec le site web demandé.

source: The URL that you requested is not available or malformed. Do not forget the `http(s)` prefix.
fr: L'URL que vous avez demandée n'est pas disponible ou est malformée. N'oubliez pas le préfixe `http(s)`.

source: It's time to test
fr: Il est temps de tester

source: your website
fr: votre site
